Revit 2026 API

# PipeFittingAndAccessoryPressureDropUIDataItem Class

---

The input and output data used by external UI servers for initializing and storing the UI settings.

SystemObject Autodesk.Revit.UI.PlumbingPipeFittingAndAccessoryPressureDropUIDataItem

**Namespace:** Autodesk.Revit.UI.Plumbing**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PipeFittingAndAccessoryPressureDropUIDataItem : IDisposable
```
```vb
Public Class PipeFittingAndAccessoryPressureDropUIDataItem
	Implements IDisposable
```
```cpp
public ref class PipeFittingAndAccessoryPressureDropUIDataItem : IDisposable
```
```fsharp
type PipeFittingAndAccessoryPressureDropUIDataItem =
    class
        interface IDisposable
    end
```

The PipeFittingAndAccessoryPressureDropUIDataItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the PipeFittingAndAccessoryPressureDropUIDataItem |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetEntity | Returns the entity set by UI server. or an invalid entity otherwise. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPipeFittingAndAccessoryData | Gets the fitting data stored in the UI data item. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetEntity | Stores the entity in the UI data item. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

One family instance has one UI data item. The UI data item contains a corresponding PipeFittingAndAccessoryData which is used for initialing the UI settings and an entity which is used for storing the UI settings.

#### Reference

Autodesk.Revit.UI.Plumbing Namespace